app/Controllers/Master/Carousel.php

    public function find_all()
    {
        $db = \Config\Database::connect();

        $query = $db->table('carousel')->get();
---
SELECT *
FROM `carousel`