app/Controllers/Master/Landing.php

    public function find_all()
    {
        $db = \Config\Database::connect();

        $query = $db->table('landing')->get();
---
SELECT *
FROM `landing`