app/Controllers/Auth.php

SELECT *
FROM `pengguna`
WHERE `username` = 'sahabatagro'
AND `is_active` = 1
---
    public function login()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Validasi input
        $validationRules = [
            'username' => 'required',
            'password' => 'required'
        ];

        if (!$this->validate($validationRules)) {
            // Jika validasi gagal, kembalikan pesan error
            $response = [
                'code' => 400,
                'message' => array_values($this->validator->getErrors())[0],
                'data' => null
            ];
            return $this->response->setJSON($response)->setStatusCode(400);
        }

        // Lakukan otentikasi pengguna berdasarkan username dan password
        // Misalnya, Anda bisa menggunakan model atau Query Builder untuk memeriksa data di database
        $pengguna = $this->db->table('pengguna')
            ->where('username', $username)
            ->where('is_active', 1)
            ->get()
            ->getRowArray();