app/Controllers/Home.php

SELECT *
FROM `carousel`
SELECT *
FROM `tentang`
SELECT *
FROM `kategori`
SELECT *
FROM `item`
SELECT *
FROM `landing`
SELECT *
FROM `gambar`
ORDER BY RAND()
 LIMIT 8
SELECT `videoyoutube`.*, `item`.`nama` as `nama_item`
FROM `videoyoutube`
LEFT JOIN `item` ON `videoyoutube`.`item_id` = `item`.`id`
ORDER BY `videoyoutube`.`id` DESC
 LIMIT 3
---
    public function index()
    {
        helper('youtube_embed');

        // Panggil metode untuk menangani kunjungan
        $visitor = new \App\Controllers\Visitor();
        $visitor->logVisitor();

        $db = \Config\Database::connect();

        $carousel = $db->table('carousel')->get();
        $tentang = $db->table('tentang')->get();
        $kategori = $db->table('kategori')->get();
        $item = $db->table('item')->get();
        $landing = $db->table('landing')->get();
        $gambar = $db->table('gambar')->orderBy('RAND()')->limit(8)->get();
        $videoyoutube = $db->table('videoyoutube')->select('videoyoutube.*, item.nama as nama_item')->join('item', 'videoyoutube.item_id = item.id', 'left')->orderBy('videoyoutube.id', 'desc')->limit(3)->get()->getResult();