app/Controllers/Landing.php

SELECT *
FROM `landing`
SELECT *
FROM `kategori`
SELECT *
FROM `item`
---
    public function index()
    {

        $db = \Config\Database::connect();
        $landing = $db->table('landing')->get();
        $kategori = $db->table('kategori')->get();
        $item = $db->table('item')->get();