app/Controllers/Pustaka.php

    public function gambar($itemId = 1)
    {
        $page = $this->request->getVar('page') ?? 1;
        $perPage = 20; // Jumlah gambar per halaman
        $start = ($page - 1) * $perPage;
        /* select data from carosel find_all() */

        $db = \Config\Database::connect();

        $carousel = $db->table('carousel')->get();
        $tentang = $db->table('tentang')->get();
        $kategori = $db->table('kategori')->get();
        $item = $db->table('item')->get();
        $itemName = $db->table('item')->select('item.nama,item.filename,item.id, kategori.nama as kategori')
            ->join('kategori', 'kategori.id = item.kategori_id', 'left')
            ->where('item.id', $itemId)->get();
---
SELECT *
FROM `carousel`
SELECT *
FROM `tentang`
SELECT *
FROM `kategori`
SELECT *
FROM `item`
SELECT `item`.`nama`, `item`.`filename`, `item`.`id`, `kategori`.`nama` as `kategori`
FROM `item`
LEFT JOIN `kategori` ON `kategori`.`id` = `item`.`kategori_id`
WHERE `item`.`id` = '13'

        $gambar = $query->get()->getResult();

        // Menghitung jumlah total data gambar
        $totalRows = $db->table('gambar')
            ->select('COUNT(*) as total_rows')
            ->join('item', 'item.id = gambar.item_id')
            ->join('kategori', 'kategori.id = item.kategori_id')
            ->where('item.id', $itemId)->get()->getRow()->total_rows;
---
SELECT COUNT(*) as total_rows
FROM `gambar`
JOIN `item` ON `item`.`id` = `gambar`.`item_id`
JOIN `kategori` ON `kategori`.`id` = `item`.`kategori_id`
WHERE `item`.`id` = '13'

    public function video($itemId = 1)
    {
        $page = $this->request->getVar('page') ?? 1;
        $perPage = 12; // Jumlah videolokal per halaman
        $start = ($page - 1) * $perPage;
        /* select data from carosel find_all() */

        $db = \Config\Database::connect();

        $carousel = $db->table('carousel')->get();
        $tentang = $db->table('tentang')->get();
        $kategori = $db->table('kategori')->get();
        $item = $db->table('item')->get();
        $itemName = $db->table('item')->select('item.nama,item.filename,item.id, kategori.nama as kategori')
            ->join('kategori', 'kategori.id = item.kategori_id', 'left')
            ->where('item.id', $itemId)->get();
---
SELECT *
FROM `carousel`
SELECT *
FROM `tentang`
SELECT *
FROM `kategori`
SELECT *
FROM `item`
SELECT `item`.`nama`, `item`.`filename`, `item`.`id`, `kategori`.`nama` as `kategori`
FROM `item`
LEFT JOIN `kategori` ON `kategori`.`id` = `item`.`kategori_id`
WHERE `item`.`id` = '1'

        $videolokal = $query->get()->getResult();

        // Menghitung jumlah total data videolokal
        $totalRows = $db->table('videolokal')
            ->select('COUNT(*) as total_rows')
            ->join('item', 'item.id = videolokal.item_id', 'left')
            ->join('kategori', 'kategori.id = item.kategori_id', 'left')
            ->where('item.id', $itemId)->get()->getRow()->total_rows;
---
SELECT COUNT(*) as total_rows
FROM `videolokal`
LEFT JOIN `item` ON `item`.`id` = `videolokal`.`item_id`
LEFT JOIN `kategori` ON `kategori`.`id` = `item`.`kategori_id`
WHERE `item`.`id` = '1'

    public function youtube($itemId = 1)
    {

        helper('youtube_embed');
        $page = $this->request->getVar('page') ?? 1;
        $perPage = 10; // Jumlah videoyoutube per halaman
        $start = ($page - 1) * $perPage;
        /* select data from carosel find_all() */

        $db = \Config\Database::connect();

        $carousel = $db->table('carousel')->get();
        $tentang = $db->table('tentang')->get();
        $kategori = $db->table('kategori')->get();
        $item = $db->table('item')->get();
        $itemName = $db->table('item')->select('item.nama,item.filename,item.id, kategori.nama as kategori')
            ->join('kategori', 'kategori.id = item.kategori_id', 'left')
            ->where('item.id', $itemId)->get();
---
SELECT *
FROM `carousel`
SELECT *
FROM `tentang`
SELECT *
FROM `kategori`
SELECT *
FROM `item`
SELECT `item`.`nama`, `item`.`filename`, `item`.`id`, `kategori`.`nama` as `kategori`
FROM `item`
LEFT JOIN `kategori` ON `kategori`.`id` = `item`.`kategori_id`
WHERE `item`.`id` = '1'

        }

        // Menghitung jumlah total data videolokal
        $totalRows = $db->table('videoyoutube')
            ->select('COUNT(*) as total_rows')
            ->join('item', 'item.id = videoyoutube.item_id', 'left')
            ->join('kategori', 'kategori.id = item.kategori_id', 'left')
            ->where('item.id', $itemId)->get()->getRow()->total_rows;
---
SELECT COUNT(*) as total_rows
FROM `videoyoutube`
LEFT JOIN `item` ON `item`.`id` = `videoyoutube`.`item_id`
LEFT JOIN `kategori` ON `kategori`.`id` = `item`.`kategori_id`
WHERE `item`.`id` = '1'