app/Controllers/Visitor.php

SELECT *
FROM `visitor`
WHERE `ip_address` = '127.0.0.1'
UPDATE `visitor` SET `counter` = 2
WHERE `ip_address` = '127.0.0.1'
---
    public function logVisitor()
    {
        // Logika penambahan counter (letakkan di tempat yang sesuai)
        $ipAddress = $_SERVER['REMOTE_ADDR'];
        // Ambil instance dari Database
        $db = \Config\Database::connect();

        $existingVisitor = $db->table('visitor')
            ->where('ip_address', $ipAddress)
            ->get()
            ->getRowArray();

        if ($existingVisitor) {
            // Jika pengunjung sudah ada, update counter
            $db->table('visitor')
                ->where('ip_address', $ipAddress)
                ->set('counter', $existingVisitor['counter'] + 1)
                ->update();